##### Intro

In [1]:
import pandas as pd
import numpy as np
from random import choice

In [2]:
soccer = pd.read_csv('soccer.csv')

In [3]:
soccer.info(verbose=False,memory_usage=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 465 entries, 0 to 464
Columns: 17 entries, name to new_signing
dtypes: float64(2), int64(10), object(5)

In [4]:
soccer.nsmallest(5,'age')

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
237,Ben Woodburn,Liverpool,17,LW,1,1.5,1241,4.5,0.10%,5,1,Wales,0,1,10,1,0
235,Trent Alexander-Arnold,Liverpool,18,RB,3,1.5,327,4.5,0.30%,15,2,England,0,1,10,1,0
354,Josh Tymon,Stoke+City,18,LB,3,1.0,120,4.5,0.10%,9,1,England,0,1,15,0,0
439,Jonathan Leko,West+Brom,18,RW,1,1.5,169,4.5,0.20%,12,1,England,0,1,19,0,0
151,Tom Davies,Everton,19,CM,2,8.0,1354,5.5,1.00%,63,1,England,0,1,7,0,0

In [5]:
soccer.head(1)

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
0,Alexis Sanchez,Arsenal,28,LW,1,65.0,4329,12.0,17.10%,264,3,Chile,0,4,1,1,0

##### What are the player that have a market value exceding 40k

In [6]:
print('numero de jugadores: ', soccer[soccer.market_value > 40].shape[0])
soccer[soccer.market_value > 40].nlargest(5,columns=['market_value'])

numero de jugadores:  13

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
96,Eden Hazard,Chelsea,26,LW,1,75.0,4220,10.5,2.30%,224,2,Belgium,0,3,5,1,0
267,Paul Pogba,Manchester+United,24,CM,2,75.0,7435,8.0,19.50%,115,2,France,0,2,12,1,1
0,Alexis Sanchez,Arsenal,28,LW,1,65.0,4329,12.0,17.10%,264,3,Chile,0,4,1,1,0
244,Kevin De Bruyne,Manchester+City,26,AM,1,65.0,2252,10.0,17.50%,199,2,Belgium,0,3,11,1,0
245,Sergio Aguero,Manchester+City,29,CF,1,65.0,4046,11.5,9.70%,175,3,Argentina,0,4,11,1,0

In [7]:
soccer[soccer.market_value > 40].shape[0]

13

##### Comparators Operator Pandas Method

In [8]:
print(soccer.age.le(25).equals(soccer.age <= 25 ))
print(soccer.market_value.le(40).equals(soccer.market_value <= 40))
soccer[soccer.age.eq(20)].shape[0]

True
True

13

##### ISIN()

In [9]:
soccer.loc[soccer.position.isin(['LB','CB','RB'])].head()

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
4,Laurent Koscielny,Arsenal,31,CB,3,22.0,912,6.0,0.70%,121,2,France,0,4,1,1,0
5,Hector Bellerin,Arsenal,22,RB,3,30.0,1675,6.0,13.70%,119,2,Spain,0,2,1,1,0
7,Nacho Monreal,Arsenal,31,LB,3,13.0,555,5.5,4.70%,115,2,Spain,0,4,1,1,0
8,Shkodran Mustafi,Arsenal,25,CB,3,30.0,1877,5.5,4.00%,90,2,Germany,0,3,1,1,1
17,Gabriel Paulista,Arsenal,26,CB,3,13.0,552,5.0,0.10%,45,3,Brazil,0,3,1,1,0

##### BETWEEN

In [10]:
soccer.loc[soccer.age.between(20,30,inclusive='neither')].sort_values(by='age',ascending=False).head(6)

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
245,Sergio Aguero,Manchester+City,29,CF,1,65.0,4046,11.5,9.70%,175,3,Argentina,0,4,11,1,0
214,Ben Hamer,Leicester+City,29,GK,4,0.5,132,4.5,0.10%,0,1,England,0,4,9,0,0
363,Martin Olsson,Swansea,29,LB,3,5.0,458,5.0,0.30%,52,2,Sweden,0,4,16,0,0
101,Pedro,Chelsea,29,RW,1,28.0,1500,8.0,7.80%,162,2,Spain,0,4,5,1,0
52,Max Gradel,Bournemouth,29,LW,1,7.0,287,5.0,0.10%,8,4,Cote d'Ivoire,0,4,2,0,0
269,Juan Mata,Manchester+United,29,AM,1,30.0,2280,7.0,3.50%,102,2,Spain,0,4,12,1,0

In [11]:
soccer.loc[(soccer.age.between(20,30,inclusive='neither') & (soccer.position.isin(['LB','CB','RB'])))].nlargest(4,'market_value')

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
256,John Stones,Manchester+City,23,CB,3,35.0,1078,5.5,2.30%,59,1,England,0,2,11,1,1
386,Toby Alderweireld,Tottenham,28,CB,3,35.0,756,6.0,13.30%,120,2,Belgium,0,4,17,1,0
5,Hector Bellerin,Arsenal,22,RB,3,30.0,1675,6.0,13.70%,119,2,Spain,0,2,1,1,0
8,Shkodran Mustafi,Arsenal,25,CB,3,30.0,1877,5.5,4.00%,90,2,Germany,0,3,1,1,1

##### conditionals: LB, 25 years old and market_value es 10m+

In [12]:
soccer.loc[(soccer.position.eq('LB') & (soccer.age.le(25) & (soccer.market_value.ge(10))))]

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
29,Sead Kolasinac,Arsenal,24,LB,3,15.0,618,6.0,6.90%,0,2,Bosnia,1,2,1,1,0
236,Alberto Moreno,Liverpool,25,LB,3,10.0,397,4.5,0.30%,8,2,Spain,0,3,10,1,0
281,Luke Shaw,Manchester+United,22,LB,3,20.0,947,5.0,0.40%,45,1,England,0,2,12,1,0
389,Ben Davies,Tottenham,24,LB,3,12.0,396,5.5,1.80%,90,2,Wales,0,2,17,1,0

##### conditions: LB, 25 de edad o mas joven, market_value 10 + y que no sea del Arsenal o Totthenham

In [13]:
soccer[(soccer.position.eq('LB')) &
       (soccer.age.le(25) ) &
       (soccer.market_value.ge(10)) &
       ~(soccer.club.isin(['Arsenal','Tottenham']))
       ]

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
236,Alberto Moreno,Liverpool,25,LB,3,10.0,397,4.5,0.30%,8,2,Spain,0,3,10,1,0
281,Luke Shaw,Manchester+United,22,LB,3,20.0,947,5.0,0.40%,45,1,England,0,2,12,1,0

##### Skill challenge

1. TheÂ´re English(Nationality)
2. Their market value is more tha twice the average market value in the league(market_value) and
3. The either have more than 4000 views (page_views) or are a new signing (new_signing) but not both

In [14]:
#1 
english = soccer.nationality.eq('England')

#2
valor = soccer.market_value.mean() * 2
valor_mas_del_doble = soccer.market_value.gt(valor)

#3
pg = (soccer.page_views.gt(4000)) | (soccer.new_signing.eq(1))



todo_junto = soccer.loc[english & valor_mas_del_doble & pg]

In [15]:
todo_junto

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
256,John Stones,Manchester+City,23,CB,3,35.0,1078,5.5,2.30%,59,1,England,0,2,11,1,1
380,Dele Alli,Tottenham,21,CM,2,45.0,4626,9.5,38.60%,225,1,England,0,1,17,1,0
381,Harry Kane,Tottenham,23,CF,1,60.0,4161,12.5,35.10%,224,1,England,0,2,17,1,0

##### lookup() is more useful when we already have some collections of labels that we want to use to do our dataframe selection

##### Sorting By Index Or Columns

In [16]:
soccer.index

RangeIndex(start=0, stop=465, step=1)

In [17]:
soccer_index = soccer.sort_index().head(5)

In [18]:
#Ponemos indice la columna name
soccer_index.set_index('name',inplace=True)
soccer_index.sort_index(inplace=True)
soccer_index.sort_index(axis=1, inplace=True)

In [19]:
soccer_index.rename(index={'name':'NAME'},inplace=True)

In [20]:
soccer_index.index.name = 'NAME'
soccer_index.head(5)

,age,age_cat,big_club,club,club_id,fpl_points,fpl_sel,fpl_value,market_value,nationality,new_foreign,new_signing,page_views,position,position_cat,region
NAME,,,,,,,,,,,,,,,,
Alexis Sanchez,28,4,1,Arsenal,1,264,17.10%,12.0,65.0,Chile,0,0,4329,LW,1,3
Laurent Koscielny,31,4,1,Arsenal,1,121,0.70%,6.0,22.0,France,0,0,912,CB,3,2
Mesut Ozil,28,4,1,Arsenal,1,167,5.60%,9.5,50.0,Germany,0,0,4395,AM,1,2
Petr Cech,35,6,1,Arsenal,1,134,5.90%,5.5,7.0,Czech Republic,0,0,1529,GK,4,2
Theo Walcott,28,4,1,Arsenal,1,122,1.50%,7.5,20.0,England,0,0,2393,RW,1,1

##### reindex()

In [21]:
# row order :  2, 1, 3, 0
# column order: age, name, position, club
soccer_index

,age,age_cat,big_club,club,club_id,fpl_points,fpl_sel,fpl_value,market_value,nationality,new_foreign,new_signing,page_views,position,position_cat,region
NAME,,,,,,,,,,,,,,,,
Alexis Sanchez,28,4,1,Arsenal,1,264,17.10%,12.0,65.0,Chile,0,0,4329,LW,1,3
Laurent Koscielny,31,4,1,Arsenal,1,121,0.70%,6.0,22.0,France,0,0,912,CB,3,2
Mesut Ozil,28,4,1,Arsenal,1,167,5.60%,9.5,50.0,Germany,0,0,4395,AM,1,2
Petr Cech,35,6,1,Arsenal,1,134,5.90%,5.5,7.0,Czech Republic,0,0,1529,GK,4,2
Theo Walcott,28,4,1,Arsenal,1,122,1.50%,7.5,20.0,England,0,0,2393,RW,1,1

In [22]:
soccer_lite = soccer.iloc[:4,:4]
# soccer_lite.reindex(index = [2,1,3,0],columns=['age','name','position','club'])

In [23]:
# Para saber que un elemento es iterable
iter(soccer_lite.columns)

In [24]:
#Se ordenan las columnas
sorted(soccer_lite.columns)

['age', 'club', 'name', 'position']

In [25]:
# soccer_lite.reindex(index=[2,1,3,0], columns=sorted(soccer_lite.columns))
# reindex method is useful when we work with dataframes with hierarchicals indices

##### Skill Challenge

In [26]:
#1
soccer_challenge2 = soccer.sort_values(by='age').head(1)

In [27]:
soccer_challenge2.set_index('club',inplace=True)
soccer_challenge2.head(5)

,name,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
club,,,,,,,,,,,,,,,,
Liverpool,Ben Woodburn,17,LW,1,1.5,1241,4.5,0.10%,5,1,Wales,0,1,10,1,0

In [28]:
soccer_challenge2.sort_index(inplace=True)

In [29]:
soccer_challenge2.sort_values(by=['club','market_value'],ascending=[True,False])

,name,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
club,,,,,,,,,,,,,,,,
Liverpool,Ben Woodburn,17,LW,1,1.5,1241,4.5,0.10%,5,1,Wales,0,1,10,1,0

##### RECONOCIENDO DUPLICADAS

In [30]:
#subset par
soccer.loc[soccer.duplicated(subset=['club','age','position','market_value'])]

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
11,Granit Xhaka,Arsenal,24,DM,2,35.0,1815,5.5,2.00%,85,2,Switzerland,0,2,1,1,0
13,Alex Oxlade-Chamberlain,Arsenal,23,RM,2,22.0,1519,6.0,1.80%,83,1,England,0,2,1,1,0
23,Alex Oxlade-Chamberlain,Arsenal,23,RM,2,22.0,1519,6.0,1.80%,83,1,England,0,2,1,1,0
59,Shane Duffy,Brighton+and+Hove,25,CB,3,5.0,243,4.5,0.60%,0,2,Ireland,0,3,3,0,0
260,Fernando,Manchester+City,32,DM,2,18.0,338,4.5,0.40%,18,3,Brazil,0,5,11,1,0
279,Chris Smalling,Manchester+United,27,CB,3,18.0,834,5.5,1.30%,52,1,England,0,3,12,1,0
293,Lascelles,Newcastle+United,27,CB,3,5.0,400,4.5,3.60%,0,1,England,0,3,13,0,0

In [31]:
#which one is the duplicated and which one is te duplicated.

In [32]:
#first original
soccer.loc[soccer.duplicated(subset=['club','age','position','market_value'],keep='first')]

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
11,Granit Xhaka,Arsenal,24,DM,2,35.0,1815,5.5,2.00%,85,2,Switzerland,0,2,1,1,0
13,Alex Oxlade-Chamberlain,Arsenal,23,RM,2,22.0,1519,6.0,1.80%,83,1,England,0,2,1,1,0
23,Alex Oxlade-Chamberlain,Arsenal,23,RM,2,22.0,1519,6.0,1.80%,83,1,England,0,2,1,1,0
59,Shane Duffy,Brighton+and+Hove,25,CB,3,5.0,243,4.5,0.60%,0,2,Ireland,0,3,3,0,0
260,Fernando,Manchester+City,32,DM,2,18.0,338,4.5,0.40%,18,3,Brazil,0,5,11,1,0
279,Chris Smalling,Manchester+United,27,CB,3,18.0,834,5.5,1.30%,52,1,England,0,3,12,1,0
293,Lascelles,Newcastle+United,27,CB,3,5.0,400,4.5,3.60%,0,1,England,0,3,13,0,0

In [33]:
#last original
soccer.loc[soccer.duplicated(subset=['club','age','position','market_value'],keep='last')]

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
10,Granit Xhaka,Arsenal,24,DM,2,35.0,1815,5.5,2.00%,85,2,Switzerland,0,2,1,1,0
12,Alex Oxlade-Chamberlain,Arsenal,23,RM,2,22.0,1519,6.0,1.80%,83,1,England,0,2,1,1,0
13,Alex Oxlade-Chamberlain,Arsenal,23,RM,2,22.0,1519,6.0,1.80%,83,1,England,0,2,1,1,0
58,Lewis Dunk,Brighton+and+Hove,25,CB,3,5.0,140,4.5,4.10%,0,1,England,0,3,3,0,0
253,Fernandinho,Manchester+City,32,DM,2,18.0,595,5.0,0.80%,78,3,Brazil,0,5,11,1,0
273,Marcos Rojo,Manchester+United,27,CB,3,18.0,1063,5.5,0.10%,77,3,Argentina,0,3,12,1,0
292,Ciaran Clark,Newcastle+United,27,CB,3,5.0,273,4.5,0.90%,0,2,Ireland,0,3,13,0,0

In [34]:
#False, te trae todos los duplicados y no conserva ningun valor, ni el primero ni el ultimo
soccer.loc[soccer.duplicated(subset=['club','age','position','market_value'],keep=False)].shape

(13, 17)

In [35]:
# OTRA FORMA DE ELIMINAR COLUMNAS
unwanted_rows = [1,2,3,4]
unwanted_columns = ['name','position','position_cat']

In [36]:
soccer.reindex(
    index= set(soccer.index).difference(unwanted_rows),
    columns = set(soccer.columns).difference(unwanted_columns)
)
#se esta creando una copia del dataframe, no se esta sobreescribiendo nada

,age,fpl_sel,club_id,new_foreign,market_value,nationality,big_club,page_views,age_cat,region,new_signing,fpl_points,fpl_value,club
0,28,17.10%,1,0,65.0,Chile,1,4329,4,3,0,264,12.0,Arsenal
5,22,13.70%,1,0,30.0,Spain,1,1675,2,2,0,119,6.0,Arsenal
6,30,2.50%,1,0,22.0,France,1,2230,4,2,0,116,8.5,Arsenal
7,31,4.70%,1,0,13.0,Spain,1,555,4,2,0,115,5.5,Arsenal
8,25,4.00%,1,0,30.0,Germany,1,1877,3,2,1,90,5.5,Arsenal
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
460,21,0.40%,20,0,5.0,Switzerland,0,288,1,2,1,38,4.5,West+Ham
461,23,0.20%,20,0,7.0,Congo DR,0,199,2,4,1,34,4.5,West+Ham
462,23,0.30%,20,0,4.5,England,0,198,2,1,0,29,4.5,West+Ham
463,21,5.90%,20,0,1.0,England,0,412,1,1,1,16,4.5,West+Ham
464,27,0.10%,20,0,10.0,Senegal,0,214,3,4,0,12,5.5,West+Ham

##### Null Values

In [37]:
soccer.age.isna()

0      False
1      False
2      False
3      False
4      False
       ...
460    False
461    False
462    False
463    False
464    False
Name: age, Length: 465, dtype: bool

In [38]:
# how many NAs are there in his dataframe?
np.count_nonzero(soccer.isna())

4

In [39]:
# which records have NAs in this dataframe?
soccer[soccer.isna().values].drop_duplicates()

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
30,Granit Xhaka,Arsenal,24,NaN,2,NaN,1815,5.5,2.00%,85,2,Switzerland,0,2,1,1,0
192,Steve Mounie,Huddersfield,22,CF,1,NaN,56,6.0,0.60%,0,2,Benin,0,2,8,0,0
195,Kasper Schmeichel,Leicester+City,30,GK,4,NaN,1601,5.0,2.40%,109,2,Denmark,0,4,9,0,0

##### Dropping And Filling Dataframe NAs

In [40]:
soccer.fillna('some meaningful replacement value').loc[[30,192,195]]

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
30,Granit Xhaka,Arsenal,24,some meaningful replacement value,2,some meaningful replacement value,1815,5.5,2.00%,85,2,Switzerland,0,2,1,1,0
192,Steve Mounie,Huddersfield,22,CF,1,some meaningful replacement value,56,6.0,0.60%,0,2,Benin,0,2,8,0,0
195,Kasper Schmeichel,Leicester+City,30,GK,4,some meaningful replacement value,1601,5.0,2.40%,109,2,Denmark,0,4,9,0,0

In [41]:
soccer.fillna({
    'market_value':100,
    'position':'RM'
}).loc[[30,192,195]]

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
30,Granit Xhaka,Arsenal,24,RM,2,100.0,1815,5.5,2.00%,85,2,Switzerland,0,2,1,1,0
192,Steve Mounie,Huddersfield,22,CF,1,100.0,56,6.0,0.60%,0,2,Benin,0,2,8,0,0
195,Kasper Schmeichel,Leicester+City,30,GK,4,100.0,1601,5.0,2.40%,109,2,Denmark,0,4,9,0,0

In [42]:
soccer.position.unique()

array(['LW', 'AM', 'GK', 'RW', 'CB', 'RB', 'CF', 'LB', 'DM', 'RM', 'CM',
       nan, 'SS', 'LM'], dtype=object)

In [43]:
# how about dropping nulls?
soccer.dropna(axis = 0,subset=['position']).head(10)

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
0,Alexis Sanchez,Arsenal,28,LW,1,65.0,4329,12.0,17.10%,264,3,Chile,0,4,1,1,0
1,Mesut Ozil,Arsenal,28,AM,1,50.0,4395,9.5,5.60%,167,2,Germany,0,4,1,1,0
2,Petr Cech,Arsenal,35,GK,4,7.0,1529,5.5,5.90%,134,2,Czech Republic,0,6,1,1,0
3,Theo Walcott,Arsenal,28,RW,1,20.0,2393,7.5,1.50%,122,1,England,0,4,1,1,0
4,Laurent Koscielny,Arsenal,31,CB,3,22.0,912,6.0,0.70%,121,2,France,0,4,1,1,0
5,Hector Bellerin,Arsenal,22,RB,3,30.0,1675,6.0,13.70%,119,2,Spain,0,2,1,1,0
6,Olivier Giroud,Arsenal,30,CF,1,22.0,2230,8.5,2.50%,116,2,France,0,4,1,1,0
7,Nacho Monreal,Arsenal,31,LB,3,13.0,555,5.5,4.70%,115,2,Spain,0,4,1,1,0
8,Shkodran Mustafi,Arsenal,25,CB,3,30.0,1877,5.5,4.00%,90,2,Germany,0,3,1,1,1
9,Alex Iwobi,Arsenal,21,LW,1,10.0,1812,5.5,1.00%,89,4,Nigeria,0,1,1,1,0

##### BONUS - Methods And Axes With fillna()

In [44]:
# Este metodo completa el valor vacio con el valor del indice anterior, cuando esta con axis=0 lo hace de la columna, con axis=1 desde la fila
# ffill: propagate last valid observation forward to next valid.
# backfill / bfill: use next valid observation to fill gap.

# This filling methods are particularly useful when working with time series data because they allows us to plug the gaps in our series with a relatively
# reasonables values in our dataset.
soccer.fillna(method='ffill',axis=0).loc[[29,30,192,195]]

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
29,Sead Kolasinac,Arsenal,24,LB,3,15.0,618,6.0,6.90%,0,2,Bosnia,1,2,1,1,0
30,Granit Xhaka,Arsenal,24,LB,2,15.0,1815,5.5,2.00%,85,2,Switzerland,0,2,1,1,0
192,Steve Mounie,Huddersfield,22,CF,1,3.0,56,6.0,0.60%,0,2,Benin,0,2,8,0,0
195,Kasper Schmeichel,Leicester+City,30,GK,4,30.0,1601,5.0,2.40%,109,2,Denmark,0,4,9,0,0

In [45]:
soccer.fillna(method='ffill',axis=1).loc[[29,30,192,195]]

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
29,Sead Kolasinac,Arsenal,24,LB,3,15.0,618,6.0,6.90%,0,2,Bosnia,1,2,1,1,0
30,Granit Xhaka,Arsenal,24,24,2,2,1815,5.5,2.00%,85,2,Switzerland,0,2,1,1,0
192,Steve Mounie,Huddersfield,22,CF,1,1,56,6.0,0.60%,0,2,Benin,0,2,8,0,0
195,Kasper Schmeichel,Leicester+City,30,GK,4,4,1601,5.0,2.40%,109,2,Denmark,0,4,9,0,0

In [46]:
soccer.fillna(method='bfill',axis=1).loc[[29,30,192,195]]

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
29,Sead Kolasinac,Arsenal,24,LB,3,15.0,618,6.0,6.90%,0,2,Bosnia,1,2,1,1,0
30,Granit Xhaka,Arsenal,24,2,2,1815,1815,5.5,2.00%,85,2,Switzerland,0,2,1,1,0
192,Steve Mounie,Huddersfield,22,CF,1,56,56,6.0,0.60%,0,2,Benin,0,2,8,0,0
195,Kasper Schmeichel,Leicester+City,30,GK,4,1601,1601,5.0,2.40%,109,2,Denmark,0,4,9,0,0

In [47]:
soccer.fillna(method='bfill',axis=0).loc[[29,30,192,195]]

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
29,Sead Kolasinac,Arsenal,24,LB,3,15.0,618,6.0,6.90%,0,2,Bosnia,1,2,1,1,0
30,Granit Xhaka,Arsenal,24,CF,2,40.0,1815,5.5,2.00%,85,2,Switzerland,0,2,1,1,0
192,Steve Mounie,Huddersfield,22,CF,1,15.0,56,6.0,0.60%,0,2,Benin,0,2,8,0,0
195,Kasper Schmeichel,Leicester+City,30,GK,4,6.0,1601,5.0,2.40%,109,2,Denmark,0,4,9,0,0

##### Skill Challenges

1. From our dataframe remove the rows labeled 2, 10, 21 and the market_value columns. Do not modify the underlying dataframe. Assing the result to df2

2. Does the nationality column in df2 contain any NA values? How many unique nationalities are there?

3. Starting from df2, isolate a datagrame slice of players that contains only the unique age-position combinations for each club. Do not include the club column itself

In [48]:
#1
df2 = soccer.drop(index=[2,10,21], columns=['market_value'])
df2.head(5)

,name,club,age,position,position_cat,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
0,Alexis Sanchez,Arsenal,28,LW,1,4329,12.0,17.10%,264,3,Chile,0,4,1,1,0
1,Mesut Ozil,Arsenal,28,AM,1,4395,9.5,5.60%,167,2,Germany,0,4,1,1,0
3,Theo Walcott,Arsenal,28,RW,1,2393,7.5,1.50%,122,1,England,0,4,1,1,0
4,Laurent Koscielny,Arsenal,31,CB,3,912,6.0,0.70%,121,2,France,0,4,1,1,0
5,Hector Bellerin,Arsenal,22,RB,3,1675,6.0,13.70%,119,2,Spain,0,2,1,1,0

In [49]:
#2
print('Valores Na: ' + str(df2.loc[df2.nationality.isna()].shape[0]))
print('Cantidad de nacionalidades: ' + str(df2.nationality.nunique()))

Valores Na: 0
Cantidad de nacionalidades: 61

In [50]:
#3
df2.drop_duplicates(subset=['age','club','position'], keep='first').reindex(columns=set(df2.columns).difference(['club']))

#columns = set(soccer.columns).difference(unwanted_columns)

,age,fpl_sel,club_id,new_foreign,nationality,big_club,page_views,position,age_cat,region,new_signing,fpl_points,fpl_value,position_cat,name
0,28,17.10%,1,0,Chile,1,4329,LW,4,3,0,264,12.0,1,Alexis Sanchez
1,28,5.60%,1,0,Germany,1,4395,AM,4,2,0,167,9.5,1,Mesut Ozil
3,28,1.50%,1,0,England,1,2393,RW,4,1,0,122,7.5,1,Theo Walcott
4,31,0.70%,1,0,France,1,912,CB,4,2,0,121,6.0,3,Laurent Koscielny
5,22,13.70%,1,0,Spain,1,1675,RB,2,2,0,119,6.0,3,Hector Bellerin
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
460,21,0.40%,20,0,Switzerland,0,288,CM,1,2,1,38,4.5,2,Edimilson Fernandes
461,23,0.20%,20,0,Congo DR,0,199,LB,2,4,1,34,4.5,3,Arthur Masuaku
462,23,0.30%,20,0,England,0,198,RB,2,1,0,29,4.5,3,Sam Byram
463,21,5.90%,20,0,England,0,412,CF,1,1,1,16,4.5,1,Ashley Fletcher
464,27,0.10%,20,0,Senegal,0,214,CF,3,4,0,12,5.5,1,Diafra Sakho

##### AGG()

In [51]:
soccer.select_dtypes(np.number).agg(['min','max','mean'])

,age,position_cat,market_value,page_views,fpl_value,fpl_points,region,new_foreign,age_cat,club_id,big_club,new_signing
min,17.000000,1.000000,0.050000,3.000000,4.000000,0.000000,1.000000,0.000000,1.000000,1.000000,0.000000,0.000000
max,38.000000,4.000000,75.000000,7664.000000,12.500000,264.000000,4.000000,1.000000,6.000000,20.000000,1.000000,1.000000
mean,26.776344,2.178495,11.125649,771.546237,5.450538,57.544086,1.989247,0.034409,3.195699,10.253763,0.309677,0.144086

In [52]:
soccer.head(1)

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
0,Alexis Sanchez,Arsenal,28,LW,1,65.0,4329,12.0,17.10%,264,3,Chile,0,4,1,1,0

In [53]:
soccer.groupby(by='club').agg(
    cantidad_jugadores = ('name', 'count'),
    suma_valor_jugadores = ('market_value','sum')
)

                   cantidad_jugadores  suma_valor_jugadores
club
Arsenal                            32                629.00
Bournemouth                        24                117.50
Brighton+and+Hove                  22                 55.50
Burnley                            18                 71.25
Chelsea                            20                553.55
Crystal+Palace                     21                162.25
Everton                            28                282.75
Huddersfield                       28                 44.65
Leicester+City                     24                197.50
Liverpool                          27                440.50
Manchester+City                    20                564.00
Manchester+United                  25                514.10
Newcastle+United                   21                109.25
Southampton                        23                230.00
Stoke+City                         22                150.00
Swansea                            25                139.00
Tottenham                          20                460.00
Watford                            24                124.00
West+Brom                          19                101.25
West+Ham                           22                194.00

##### Transform

In [54]:
soccer.loc[:, ['market_value','fpl_value']].transform(lambda x: x * 0.91)

     market_value  fpl_value
0          59.150     10.920
1          45.500      8.645
2           6.370      5.005
3          18.200      6.825
4          20.020      5.460
..            ...        ...
460         4.550      4.095
461         6.370      4.095
462         4.095      4.095
463         0.910      4.095
464         9.100      5.005

[465 rows x 2 columns]

In [55]:
soccer.loc[:, ['market_value','fpl_value']] * 0.91

     market_value  fpl_value
0          59.150     10.920
1          45.500      8.645
2           6.370      5.005
3          18.200      6.825
4          20.020      5.460
..            ...        ...
460         4.550      4.095
461         6.370      4.095
462         4.095      4.095
463         0.910      4.095
464         9.100      5.005

[465 rows x 2 columns]

##### str methods

In [56]:
soccer.name.str.title()

0           Alexis Sanchez
1               Mesut Ozil
2                Petr Cech
3             Theo Walcott
4        Laurent Koscielny
              ...
460    Edimilson Fernandes
461         Arthur Masuaku
462              Sam Byram
463        Ashley Fletcher
464           Diafra Sakho
Name: name, Length: 465, dtype: object

In [57]:
soccer.name.str.upper()

0           ALEXIS SANCHEZ
1               MESUT OZIL
2                PETR CECH
3             THEO WALCOTT
4        LAURENT KOSCIELNY
              ...
460    EDIMILSON FERNANDES
461         ARTHUR MASUAKU
462              SAM BYRAM
463        ASHLEY FLETCHER
464           DIAFRA SAKHO
Name: name, Length: 465, dtype: object

In [58]:
soccer.name.str.swapcase()

0           aLEXIS sANCHEZ
1               mESUT oZIL
2                pETR cECH
3             tHEO wALCOTT
4        lAURENT kOSCIELNY
              ...
460    eDIMILSON fERNANDES
461         aRTHUR mASUAKU
462              sAM bYRAM
463        aSHLEY fLETCHER
464           dIAFRA sAKHO
Name: name, Length: 465, dtype: object

In [59]:
def random_case(x):
    funcs = [x.str.swapcase,x.str.upper,x.str.lower,x.str.title]
    return choice(funcs)()

In [60]:
for i in range(4):
    print(soccer.select_dtypes(include=object).transform(random_case).head(5))

                name     club position fpl_sel     nationality
0     aLEXIS sANCHEZ  aRSENAL       LW  17.10%           cHILE
1         mESUT oZIL  aRSENAL       AM   5.60%         gERMANY
2          pETR cECH  aRSENAL       GK   5.90%  cZECH rEPUBLIC
3       tHEO wALCOTT  aRSENAL       RW   1.50%         eNGLAND
4  lAURENT kOSCIELNY  aRSENAL       CB   0.70%          fRANCE
                name     club position fpl_sel     nationality
0     alexis sanchez  ARSENAL       lw  17.10%           cHILE
1         mesut ozil  ARSENAL       am   5.60%         gERMANY
2          petr cech  ARSENAL       gk   5.90%  cZECH rEPUBLIC
3       theo walcott  ARSENAL       rw   1.50%         eNGLAND
4  laurent koscielny  ARSENAL       cb   0.70%          fRANCE
                name     club position fpl_sel     nationality
0     alexis sanchez  arsenal       Lw  17.10%           Chile
1         mesut ozil  arsenal       Am   5.60%         Germany
2          petr cech  arsenal       Gk   5.90%  Czech Republic
3       theo walcott  arsenal       Rw   1.50%         England
4  laurent koscielny  arsenal       Cb   0.70%          France
                name     club position fpl_sel     nationality
0     Alexis Sanchez  Arsenal       lw  17.10%           cHILE
1         Mesut Ozil  Arsenal       am   5.60%         gERMANY
2          Petr Cech  Arsenal       gk   5.90%  cZECH rEPUBLIC
3       Theo Walcott  Arsenal       rw   1.50%         eNGLAND
4  Laurent Koscielny  Arsenal       cb   0.70%          fRANCE

##### More flexibility with apply()

In [61]:
def round_floats(x):
    if x.dtype == np.float64:
        return round(x)
    return x

In [62]:
soccer.select_dtypes(np.float64).head(15)

    market_value  fpl_value
0           65.0       12.0
1           50.0        9.5
2            7.0        5.5
3           20.0        7.5
4           22.0        6.0
5           30.0        6.0
6           22.0        8.5
7           13.0        5.5
8           30.0        5.5
9           10.0        5.5
10          35.0        5.5
11          35.0        5.5
12          22.0        6.0
13          22.0        6.0
14          18.0        5.5

In [63]:
soccer.select_dtypes(np.float64).apply(round_floats).head()

   market_value  fpl_value
0          65.0       12.0
1          50.0       10.0
2           7.0        6.0
3          20.0        8.0
4          22.0        6.0

In [64]:
soccer.select_dtypes(np.int64).apply('mean', axis=0)

age              26.776344
position_cat      2.178495
page_views      771.546237
fpl_points       57.544086
region            1.989247
new_foreign       0.034409
age_cat           3.195699
club_id          10.253763
big_club          0.309677
new_signing       0.144086
dtype: float64

In [65]:
soccer.loc[:, [dtype != object for dtype in soccer.dtypes]].agg('mean')

age              26.776344
position_cat      2.178495
market_value     11.125649
page_views      771.546237
fpl_value         5.450538
fpl_points       57.544086
region            1.989247
new_foreign       0.034409
age_cat           3.195699
club_id          10.253763
big_club          0.309677
new_signing       0.144086
dtype: float64

##### APPLYMAP()

In [66]:
from datetime import datetime
counter = 0
inflation = 1.02
def log_and_transfor(x):
    global counter
    counter += 1
    if counter % 100 == 0:
        print(f"It is {datetime.now()} and I just adjusted the {counter}th value.")
    
    return x * inflation

In [67]:
import sys
sys.version

'3.11.1 (tags/v3.11.1:a7a450f, Dec  6 2022, 19:58:39) [MSC v.1934 64 bit (AMD64)]'

In [68]:
mini_df = soccer.loc[:, ['market_value','fpl_value']]
mini_df

     market_value  fpl_value
0            65.0       12.0
1            50.0        9.5
2             7.0        5.5
3            20.0        7.5
4            22.0        6.0
..            ...        ...
460           5.0        4.5
461           7.0        4.5
462           4.5        4.5
463           1.0        4.5
464          10.0        5.5

[465 rows x 2 columns]

In [69]:
mini_df.applymap(log_and_transfor)

It is 2024-02-08 16:34:47.355700 and I just adjusted the 100th value.
It is 2024-02-08 16:34:47.357700 and I just adjusted the 200th value.
It is 2024-02-08 16:34:47.357700 and I just adjusted the 300th value.
It is 2024-02-08 16:34:47.357700 and I just adjusted the 400th value.
It is 2024-02-08 16:34:47.358694 and I just adjusted the 500th value.
It is 2024-02-08 16:34:47.358694 and I just adjusted the 600th value.
It is 2024-02-08 16:34:47.358694 and I just adjusted the 700th value.
It is 2024-02-08 16:34:47.358694 and I just adjusted the 800th value.
It is 2024-02-08 16:34:47.358694 and I just adjusted the 900th value.

     market_value  fpl_value
0           66.30      12.24
1           51.00       9.69
2            7.14       5.61
3           20.40       7.65
4           22.44       6.12
..            ...        ...
460          5.10       4.59
461          7.14       4.59
462          4.59       4.59
463          1.02       4.59
464         10.20       5.61

[465 rows x 2 columns]

##### Skill Challenge

1. Create a standalone function that
    - Accepts a single parameter x
    - Returns the string 'relatively unkown' if x is less than 220
    - 'kind of popular' if x is between 220 and 600 (non-inclusive)
    - 'popular' if x is between 600 and 2000(non-inclusive)
    - 'super-popular' otherwise

2. Apply the function from the step above to the players page_views column. Use a method that supports vectorized operations
3. Add the output from the step above as a new column to the soccer dataframe. Name the column popularity
4. How many 'super-popular' players are there?

In [70]:
#1 
def population(x):
    if x < 220:
        return 'relatively unkown'
    elif x < 600:
        return 'kind of popular'
    elif x < 2000:
        return 'popular'
    else:
        return 'super-popular'

In [71]:
#2
soccer.page_views.apply(population)
#3
soccer['popularity'] = soccer.page_views.apply(population)

In [72]:
#4 
soccer.loc[soccer.popularity.eq('super-popular')].shape[0]
soccer.popularity.value_counts()
soccer[soccer.popularity == 'super-popular'].name.size

37

In [73]:
soccer.loc[:,['name','club']]

                    name      club
0         Alexis Sanchez   Arsenal
1             Mesut Ozil   Arsenal
2              Petr Cech   Arsenal
3           Theo Walcott   Arsenal
4      Laurent Koscielny   Arsenal
..                   ...       ...
460  Edimilson Fernandes  West+Ham
461       Arthur Masuaku  West+Ham
462            Sam Byram  West+Ham
463      Ashley Fletcher  West+Ham
464         Diafra Sakho  West+Ham

[465 rows x 2 columns]

##### Adding Dataframe columns

In [74]:
soccer['MVtoFPL'] = soccer['market_value'] / soccer['fpl_value']

insert()

In [75]:
df_mini2 = soccer.loc[:3,['club', 'age','position']]
df_mini2.head()

      club  age position
0  Arsenal   28       LW
1  Arsenal   28       AM
2  Arsenal   35       GK
3  Arsenal   28       RW

In [76]:
player_names = pd.Series(['Bronson','Bradley','Ronald','Ronny'])
df_mini2.insert(0,'nicknames',player_names)
df_mini2

  nicknames     club  age position
0   Bronson  Arsenal   28       LW
1   Bradley  Arsenal   28       AM
2    Ronald  Arsenal   35       GK
3     Ronny  Arsenal   28       RW

the asign() approach

In [77]:
#Da como resultado una copia, por lo que al asignar no se inserta en el dataframe original
df_mini2.assign(career_goals=[12,67,179,49])

  nicknames     club  age position  career_goals
0   Bronson  Arsenal   28       LW            12
1   Bradley  Arsenal   28       AM            67
2    Ronald  Arsenal   35       GK           179
3     Ronny  Arsenal   28       RW            49

##### Skill Challenge

In [78]:
df_random = soccer.sample(4).sample(4, axis=1)
df_random

                  club  market_value  new_signing  position_cat
421            Watford           4.0            0             3
222          Liverpool          25.0            0             1
363            Swansea           5.0            0             3
273  Manchester+United          18.0            0             3

##### Introducing 5 new datasets for Section 6

In [79]:
eng_url = 'https://andybek.com/pandas-eng'
state_url = 'https://andybek.com/pandas-state'
party_url = 'https://andybek.com/pandas-party'
liberal_url = 'https://andybek.com/pandas-liberal'
ivies_url = 'https://andybek.com/pandas-ivies'

In [80]:
eng = pd.read_csv(eng_url)
state = pd.read_csv(state_url)
party = pd.read_csv(party_url)
liberal = pd.read_csv(liberal_url)
ivies = pd.read_csv(ivies_url)

In [81]:
dfs = [state, eng, party, liberal, ivies]

In [82]:
for df in dfs:
    print(df.shape)

(175, 4)
(19, 4)
(20, 4)
(47, 4)
(8, 4)

##### Concat()

In [83]:
pd.concat([ivies, party]).head()

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,Dartmouth College,Ivy League,"$58,000.00","$134,000.00"
1,Princeton University,Ivy League,"$66,500.00","$131,000.00"
2,Yale University,Ivy League,"$59,100.00","$126,000.00"
3,Harvard University,Ivy League,"$63,400.00","$124,000.00"
4,University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00"

In [84]:
pd.concat(dfs)

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,"University of California, Berkeley",State,"$59,900.00","$112,000.00"
1,University of Virginia (UVA),State,"$52,700.00","$103,000.00"
2,Cal Poly San Luis Obispo,State,"$57,200.00","$101,000.00"
3,University of California at Los Angeles (UCLA),State,"$52,600.00","$101,000.00"
4,"University of California, San Diego (UCSD)",State,"$51,100.00","$101,000.00"
...,...,...,...,...
3,Harvard University,Ivy League,"$63,400.00","$124,000.00"
4,University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00"
5,Cornell University,Ivy League,"$60,300.00","$110,000.00"
6,Brown University,Ivy League,"$56,200.00","$109,000.00"
7,Columbia University,Ivy League,"$59,400.00","$107,000.00"

In [85]:
# aca vemos cuantos registros diferentes hay en la union que hicimos anteriormente.
set(party['School Name']).difference(state['School Name'])

{'Randolph-Macon College'}

In [86]:
# Vemos la cantidad de repetidos por School Name
pd.concat(dfs)[pd.concat(dfs).duplicated(subset=['School Name'], keep='first')]

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,University of Illinois at Urbana-Champaign (UIUC),Party,"$52,900.00","$96,100.00"
1,"University of Maryland, College Park",Party,"$52,000.00","$95,000.00"
2,"University of California, Santa Barbara (UCSB)",Party,"$50,500.00","$95,000.00"
3,University of Texas (UT) - Austin,Party,"$49,700.00","$93,900.00"
4,State University of New York (SUNY) at Albany,Party,"$44,500.00","$92,200.00"
5,University of Florida (UF),Party,"$47,100.00","$87,900.00"
6,Louisiana State University (LSU),Party,"$46,900.00","$87,800.00"
7,University of Georgia (UGA),Party,"$44,100.00","$86,000.00"
8,Pennsylvania State University (PSU),Party,"$49,900.00","$85,700.00"
9,Arizona State University (ASU),Party,"$47,400.00","$84,100.00"
10,"Indiana University (IU), Bloomington",Party,"$46,300.00","$84,000.00"
11,University of Iowa (UI),Party,"$44,700.00","$83,900.00"
13,"University of Alabama, Tuscaloosa",Party,"$41,300.00","$81,400.00"
14,University of Mississippi,Party,"$41,400.00","$79,700.00"
15,University of New Hampshire (UNH),Party,"$41,800.00","$78,300.00"
16,West Virginia University (WVU),Party,"$43,100.00","$78,100.00"
17,University of Tennessee,Party,"$43,800.00","$74,600.00"
18,Ohio University,Party,"$42,200.00","$73,400.00"
19,Florida State University (FSU),Party,"$42,100.00","$73,000.00"
28,Randolph-Macon College,Liberal Arts,"$42,600.00","$83,600.00"

In [87]:
schools = pd.concat(dfs).drop_duplicates(subset= 'School Name')

In [88]:
schools.head()

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,"University of California, Berkeley",State,"$59,900.00","$112,000.00"
1,University of Virginia (UVA),State,"$52,700.00","$103,000.00"
2,Cal Poly San Luis Obispo,State,"$57,200.00","$101,000.00"
3,University of California at Los Angeles (UCLA),State,"$52,600.00","$101,000.00"
4,"University of California, San Diego (UCSD)",State,"$51,100.00","$101,000.00"

##### The duplicates Index() Issue

In [89]:
# Se repite el indice despues que concatenamos
schools.loc[0]

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,"University of California, Berkeley",State,"$59,900.00","$112,000.00"
0,Massachusetts Institute of Technology (MIT),Engineering,"$72,200.00","$126,000.00"
0,Bucknell University,Liberal Arts,"$54,100.00","$110,000.00"
0,Dartmouth College,Ivy League,"$58,000.00","$134,000.00"

In [90]:
schools.loc[schools.index.duplicated()]

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,Massachusetts Institute of Technology (MIT),Engineering,"$72,200.00","$126,000.00"
1,California Institute of Technology (CIT),Engineering,"$75,500.00","$123,000.00"
2,Harvey Mudd College,Engineering,"$71,800.00","$122,000.00"
3,"Polytechnic University of New York, Brooklyn",Engineering,"$62,400.00","$114,000.00"
4,Cooper Union,Engineering,"$62,200.00","$114,000.00"
...,...,...,...,...
3,Harvard University,Ivy League,"$63,400.00","$124,000.00"
4,University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00"
5,Cornell University,Ivy League,"$60,300.00","$110,000.00"
6,Brown University,Ivy League,"$56,200.00","$109,000.00"
7,Columbia University,Ivy League,"$59,400.00","$107,000.00"

in pandas, we could have duplicated indices!

schools.loc[0:2] # does not work anymore

the first fix

In [91]:
schools.reset_index(drop=True, inplace=True)

In [92]:
schools.index.duplicated().sum()

0

the alternative approach concat

In [93]:
schools = pd.concat(dfs, ignore_index=True).drop_duplicates(subset=['School Name'])
print(f'duplicados: {schools.index.duplicated().sum()}')
schools

duplicados: 0

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,"University of California, Berkeley",State,"$59,900.00","$112,000.00"
1,University of Virginia (UVA),State,"$52,700.00","$103,000.00"
2,Cal Poly San Luis Obispo,State,"$57,200.00","$101,000.00"
3,University of California at Los Angeles (UCLA),State,"$52,600.00","$101,000.00"
4,"University of California, San Diego (UCSD)",State,"$51,100.00","$101,000.00"
...,...,...,...,...
264,Harvard University,Ivy League,"$63,400.00","$124,000.00"
265,University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00"
266,Cornell University,Ivy League,"$60,300.00","$110,000.00"
267,Brown University,Ivy League,"$56,200.00","$109,000.00"
268,Columbia University,Ivy League,"$59,400.00","$107,000.00"

In [94]:
schools.sample(axis=1).sample(4,axis=0)

    Starting Median Salary
152            $43,600.00
171            $40,400.00
138            $42,600.00
155            $41,400.00

Previoulsy: df.reset_index(drop=True) OR pd.concat(dfs, ignore_index=True)

GOAL: What if we wnated to preserve the index AND force uniqueness

In [95]:
ivies

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,Dartmouth College,Ivy League,"$58,000.00","$134,000.00"
1,Princeton University,Ivy League,"$66,500.00","$131,000.00"
2,Yale University,Ivy League,"$59,100.00","$126,000.00"
3,Harvard University,Ivy League,"$63,400.00","$124,000.00"
4,University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00"
5,Cornell University,Ivy League,"$60,300.00","$110,000.00"
6,Brown University,Ivy League,"$56,200.00","$109,000.00"
7,Columbia University,Ivy League,"$59,400.00","$107,000.00"

In [96]:
ivies2 = ivies.set_index('School Name')

In [97]:
eng2 = eng.set_index('School Name')

In [98]:
#verify_integrity verifica que no haya duplicados, si hay duplicados tira error.
pd.concat([ivies2, eng2], verify_integrity=True).index.duplicated().sum()

0

In [99]:
random_eng_school = eng2.sample()
random_eng_school

              School Type Starting Median Salary Mid-Career Median Salary
School Name
Cooper Union  Engineering            $62,200.00              $114,000.00

In [100]:
ivies2 = pd.concat([ivies2, random_eng_school])

In [101]:
try:
    result = pd.concat([ivies2,eng2],verify_integrity=True)
except ValueError as e:
    error_mesage = str(e)
    print(f'Error Message: {error_mesage}')

Error Message: Indexes have overlapping values: Index(['Cooper Union'], dtype='object', name='School Name')

##### Creating Multiple Indices With concat()

In [102]:
new_df = pd.concat([ivies,eng], keys= ['ivyleague_schools','engineering_schools'])
new_df.head()

                                    School Name School Type  \
ivyleague_schools 0           Dartmouth College  Ivy League
                  1        Princeton University  Ivy League
                  2             Yale University  Ivy League
                  3          Harvard University  Ivy League
                  4  University of Pennsylvania  Ivy League

                    Starting Median Salary Mid-Career Median Salary
ivyleague_schools 0            $58,000.00              $134,000.00
                  1            $66,500.00              $131,000.00
                  2            $59,100.00              $126,000.00
                  3            $63,400.00              $124,000.00
                  4            $60,900.00              $120,000.00

In [103]:
print(type(new_df.index))
new_df.loc[('ivyleague_schools', 3)]
new_df.iloc[:5]

<class 'pandas.core.indexes.multi.MultiIndex'>

                                    School Name School Type  \
ivyleague_schools 0           Dartmouth College  Ivy League
                  1        Princeton University  Ivy League
                  2             Yale University  Ivy League
                  3          Harvard University  Ivy League
                  4  University of Pennsylvania  Ivy League

                    Starting Median Salary Mid-Career Median Salary
ivyleague_schools 0            $58,000.00              $134,000.00
                  1            $66,500.00              $131,000.00
                  2            $59,100.00              $126,000.00
                  3            $63,400.00              $124,000.00
                  4            $60,900.00              $120,000.00

##### Skill Challenge reveer este challenge en el curso

1. Concatenate the liberal and state schools into a new dataframe. How many unique school names are there?
2. Whati is the average median starting salary in the dataframe created above?
3.  Create a short dataframe that shows the top 3 liberal arts and state schools that produce the highest(mid-career) earning graduates.
    Show the School Name and Mid-Career Median Salary columns from each dataset, side by side, i.e horizontally
    BONUS: nest the column labels within 'Liberal Arts0 and 'State' labels.

In [104]:
#1
df5 = pd.concat([liberal,schools])
df5['School Name'].nunique()

249

In [105]:
#2
df5.iloc[:,3].replace('\$|,','',regex=True).astype(float).mean()

84746.28378378379

In [120]:
#2
df5.iloc[:,2].replace('\$|,','',regex=True).astype(float).mean()

state2 = state.iloc[(state.iloc[:,3].replace('\$|,','',regex=True).astype(float).nlargest(3).index),[0,3]]
state2

                          School Name Mid-Career Median Salary
0  University of California, Berkeley             $112,000.00
1        University of Virginia (UVA)             $103,000.00
2            Cal Poly San Luis Obispo             $101,000.00

In [121]:
lib2 = liberal.iloc[(liberal.iloc[:,3].replace('\$|,','',regex=True).astype(float).nlargest(3).index),[0,3]]
lib2

           School Name Mid-Career Median Salary
0  Bucknell University             $110,000.00
1   Colgate University             $108,000.00
2      Amherst College             $107,000.00

In [123]:
pd.concat([state2,lib2],axis=1,keys=['Liberal Arts','State'])

                         Liberal Arts                           \
                          School Name Mid-Career Median Salary
0  University of California, Berkeley             $112,000.00
1        University of Virginia (UVA)             $103,000.00
2            Cal Poly San Luis Obispo             $101,000.00

                 State
           School Name Mid-Career Median Salary
0  Bucknell University             $110,000.00
1   Colgate University             $108,000.00
2      Amherst College             $107,000.00

In [117]:
lib3 = liberal.sort_values(by=['Mid-Career Median Salary'],ascending=False).iloc[:3,[0,3]].reset_index(drop=True)
lib3

                                     School Name Mid-Career Median Salary
0  Wesleyan University (Middletown, Connecticut)              $97,900.00
1                                  Bates College              $96,500.00
2                                  Union College              $95,800.00

In [118]:
state3 = state.sort_values(by=['Mid-Career Median Salary'],ascending=False).iloc[:3,[0,3]].reset_index(drop=True)
state3

                              School Name Mid-Career Median Salary
0         University of California, Davis              $99,600.00
1  University of Colorado - Boulder (UCB)              $97,600.00
2  University of California, Irvine (UCI)              $96,700.00

In [ ]:
pd.concat([liberal2,state2], axis=1, keys=['Liberal Arts','State']).reset_index(drop=True)

          Liberal Arts                           \
           School Name Mid-Career Median Salary
0  Bucknell University             $110,000.00
1   Colgate University             $108,000.00
2      Amherst College             $107,000.00

                                State
                          School Name Mid-Career Median Salary
0  University of California, Berkeley             $112,000.00
1        University of Virginia (UVA)             $103,000.00
2            Cal Poly San Luis Obispo             $101,000.00

In [ ]:
#3

##### The merge() Method

In [ ]:
regiones_url = 'https://andybek.com/pandas-regions'
regiones = pd.read_csv(regiones_url)

In [ ]:
regiones.head()
print(regiones.shape[1])
print(schools.shape[1])
pd.merge(schools,regiones, on='School Name')

2
4

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Region
0,"University of California, Berkeley",State,"$59,900.00","$112,000.00",California
1,University of Virginia (UVA),State,"$52,700.00","$103,000.00",Southern
2,Cal Poly San Luis Obispo,State,"$57,200.00","$101,000.00",California
3,University of California at Los Angeles (UCLA),State,"$52,600.00","$101,000.00",California
4,"University of California, San Diego (UCSD)",State,"$51,100.00","$101,000.00",California
...,...,...,...,...,...
264,Harvard University,Ivy League,"$63,400.00","$124,000.00",Northeastern
265,University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00",Northeastern
266,Cornell University,Ivy League,"$60,300.00","$110,000.00",Northeastern
267,Brown University,Ivy League,"$56,200.00","$109,000.00",Northeastern
268,Columbia University,Ivy League,"$59,400.00","$107,000.00",Northeastern

In [ ]:
income_url = 'https://andybek.com/pandas-mid'
mid_career = pd.read_csv(income_url)

In [ ]:
mid_career.head()

,school_name,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Massachusetts Institute of Technology (MIT),"$76,800.00","$99,200.00","$168,000.00","$220,000.00"
1,California Institute of Technology (CIT),NaN,"$104,000.00","$161,000.00",NaN
2,Harvey Mudd College,NaN,"$96,000.00","$180,000.00",NaN
3,"Polytechnic University of New York, Brooklyn","$66,800.00","$94,300.00","$143,000.00","$190,000.00"
4,Cooper Union,NaN,"$80,200.00","$142,000.00",NaN

In [ ]:
pd.merge(schools, mid_career, left_on='School Name', right_on='school_name').drop('school_name',axis=1).head()

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,"University of California, Berkeley",State,"$59,900.00","$112,000.00","$59,500.00","$81,000.00","$149,000.00","$201,000.00"
1,University of Virginia (UVA),State,"$52,700.00","$103,000.00","$52,200.00","$71,800.00","$146,000.00","$215,000.00"
2,Cal Poly San Luis Obispo,State,"$57,200.00","$101,000.00","$55,000.00","$74,700.00","$133,000.00","$178,000.00"
3,University of California at Los Angeles (UCLA),State,"$52,600.00","$101,000.00","$51,300.00","$72,500.00","$139,000.00","$193,000.00"
4,"University of California, San Diego (UCSD)",State,"$51,100.00","$101,000.00","$51,700.00","$75,400.00","$131,000.00","$177,000.00"

In [ ]:
pd.merge(ivies,regiones,how='right')

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Region
0,Massachusetts Institute of Technology (MIT),NaN,NaN,NaN,Northeastern
1,California Institute of Technology (CIT),NaN,NaN,NaN,California
2,Harvey Mudd College,NaN,NaN,NaN,California
3,"Polytechnic University of New York, Brooklyn",NaN,NaN,NaN,Northeastern
4,Cooper Union,NaN,NaN,NaN,Northeastern
...,...,...,...,...,...
264,Austin Peay State University,NaN,NaN,NaN,Southern
265,Pittsburg State University,NaN,NaN,NaN,Midwestern
266,Southern Utah University,NaN,NaN,NaN,Western
267,Montana State University - Billings,NaN,NaN,NaN,Western
268,Black Hills State University,NaN,NaN,NaN,Midwestern

In [ ]:
ivies

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,Dartmouth College,Ivy League,"$58,000.00","$134,000.00"
1,Princeton University,Ivy League,"$66,500.00","$131,000.00"
2,Yale University,Ivy League,"$59,100.00","$126,000.00"
3,Harvard University,Ivy League,"$63,400.00","$124,000.00"
4,University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00"
5,Cornell University,Ivy League,"$60,300.00","$110,000.00"
6,Brown University,Ivy League,"$56,200.00","$109,000.00"
7,Columbia University,Ivy League,"$59,400.00","$107,000.00"

In [ ]:
regiones

                                      School Name        Region
0     Massachusetts Institute of Technology (MIT)  Northeastern
1        California Institute of Technology (CIT)    California
2                             Harvey Mudd College    California
3    Polytechnic University of New York, Brooklyn  Northeastern
4                                    Cooper Union  Northeastern
..                                            ...           ...
264                  Austin Peay State University      Southern
265                    Pittsburg State University    Midwestern
266                      Southern Utah University       Western
267           Montana State University - Billings       Western
268                  Black Hills State University    Midwestern

[269 rows x 2 columns]

###### ONE TO ONE

In [ ]:
regiones[regiones['School Name'].isin(ivies['School Name'])]
# we got the exactly the 8 ivies school, so we've confirmed that both datasets have a unique values on the key column for the keys that they have in common

                   School Name        Region
86           Dartmouth College  Northeastern
87        Princeton University  Northeastern
88             Yale University  Northeastern
89          Harvard University  Northeastern
90  University of Pennsylvania  Northeastern
91          Cornell University  Northeastern
92            Brown University  Northeastern
93         Columbia University  Northeastern

In [ ]:
pd.merge(ivies,regiones,how='inner', on= 'School Name')

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Region
0,Dartmouth College,Ivy League,"$58,000.00","$134,000.00",Northeastern
1,Princeton University,Ivy League,"$66,500.00","$131,000.00",Northeastern
2,Yale University,Ivy League,"$59,100.00","$126,000.00",Northeastern
3,Harvard University,Ivy League,"$63,400.00","$124,000.00",Northeastern
4,University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00",Northeastern
5,Cornell University,Ivy League,"$60,300.00","$110,000.00",Northeastern
6,Brown University,Ivy League,"$56,200.00","$109,000.00",Northeastern
7,Columbia University,Ivy League,"$59,400.00","$107,000.00",Northeastern

###### ONE TO MANY

In [ ]:
state

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,"University of California, Berkeley",State,"$59,900.00","$112,000.00"
1,University of Virginia (UVA),State,"$52,700.00","$103,000.00"
2,Cal Poly San Luis Obispo,State,"$57,200.00","$101,000.00"
3,University of California at Los Angeles (UCLA),State,"$52,600.00","$101,000.00"
4,"University of California, San Diego (UCSD)",State,"$51,100.00","$101,000.00"
...,...,...,...,...
170,Austin Peay State University,State,"$37,700.00","$59,200.00"
171,Pittsburg State University,State,"$40,400.00","$58,200.00"
172,Southern Utah University,State,"$41,900.00","$56,500.00"
173,Montana State University - Billings,State,"$37,900.00","$50,600.00"
174,Black Hills State University,State,"$35,300.00","$43,900.00"

In [ ]:
state['School Name'].nunique

<bound method IndexOpsMixin.nunique of 0                  University of California, Berkeley
1                        University of Virginia (UVA)
2                            Cal Poly San Luis Obispo
3      University of California at Los Angeles (UCLA)
4          University of California, San Diego (UCSD)
                            ...
170                      Austin Peay State University
171                        Pittsburg State University
172                          Southern Utah University
173               Montana State University - Billings
174                      Black Hills State University
Name: School Name, Length: 175, dtype: object>

In [ ]:
regiones[regiones['School Name'].isin(state['School Name'])]

                                           School Name        Region
19   University of Illinois at Urbana-Champaign (UIUC)    Midwestern
20                University of Maryland, College Park      Southern
21      University of California, Santa Barbara (UCSB)    California
22                   University of Texas (UT) - Austin      Southern
23       State University of New York (SUNY) at Albany  Northeastern
..                                                 ...           ...
264                       Austin Peay State University      Southern
265                         Pittsburg State University    Midwestern
266                           Southern Utah University       Western
267                Montana State University - Billings       Western
268                       Black Hills State University    Midwestern

[194 rows x 2 columns]

In [ ]:
# the region dataframes duplicated, is one to many asociations
regiones[regiones['School Name'].isin(state['School Name'])].loc[:, 'School Name'].value_counts()

School Name
University of Illinois at Urbana-Champaign (UIUC)    2
Indiana University (IU), Bloomington                 2
University of Maryland, College Park                 2
Ohio University                                      2
University of Tennessee                              2
                                                    ..
University of Illinois at Chicago                    1
State University of New York (SUNY) at Buffalo       1
University of Kansas                                 1
University of New Mexico (UNM)                       1
Black Hills State University                         1
Name: count, Length: 175, dtype: int64

In [ ]:
#we have duplicated
pd.merge(state,regiones, how='inner', on='School Name').sort_values(by='School Name')

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Region
169,Appalachian State University,State,"$40,400.00","$69,100.00",Southern
58,Arizona State University (ASU),State,"$47,400.00","$84,100.00",Western
57,Arizona State University (ASU),State,"$47,400.00","$84,100.00",Western
184,Arkansas State University (ASU),State,"$38,700.00","$63,300.00",Southern
48,Auburn University,State,"$45,400.00","$84,700.00",Southern
...,...,...,...,...,...
107,West Virginia University (WVU),State,"$43,100.00","$78,100.00",Southern
108,West Virginia University (WVU),State,"$43,100.00","$78,100.00",Southern
175,Western Carolina University,State,"$36,900.00","$66,600.00",Southern
131,Western Michigan University (WMU),State,"$42,300.00","$73,800.00",Midwestern
122,Western Washington University,State,"$42,700.00","$75,400.00",Western

In [ ]:
pd.merge(state, regiones.drop_duplicates()).sort_values(by='School Name')

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Region
150,Appalachian State University,State,"$40,400.00","$69,100.00",Southern
48,Arizona State University (ASU),State,"$47,400.00","$84,100.00",Western
165,Arkansas State University (ASU),State,"$38,700.00","$63,300.00",Southern
39,Auburn University,State,"$45,400.00","$84,700.00",Southern
170,Austin Peay State University,State,"$37,700.00","$59,200.00",Southern
...,...,...,...,...,...
101,Wayne State University,State,"$42,800.00","$76,100.00",Midwestern
92,West Virginia University (WVU),State,"$43,100.00","$78,100.00",Southern
156,Western Carolina University,State,"$36,900.00","$66,600.00",Southern
114,Western Michigan University (WMU),State,"$42,300.00","$73,800.00",Midwestern
106,Western Washington University,State,"$42,700.00","$75,400.00",Western

In [ ]:
pd.merge(state,regiones,how='inner', on='School Name').sort_values(by='School Name').drop_duplicates()

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Region
169,Appalachian State University,State,"$40,400.00","$69,100.00",Southern
58,Arizona State University (ASU),State,"$47,400.00","$84,100.00",Western
184,Arkansas State University (ASU),State,"$38,700.00","$63,300.00",Southern
48,Auburn University,State,"$45,400.00","$84,700.00",Southern
189,Austin Peay State University,State,"$37,700.00","$59,200.00",Southern
...,...,...,...,...,...
117,Wayne State University,State,"$42,800.00","$76,100.00",Midwestern
107,West Virginia University (WVU),State,"$43,100.00","$78,100.00",Southern
175,Western Carolina University,State,"$36,900.00","$66,600.00",Southern
131,Western Michigan University (WMU),State,"$42,300.00","$73,800.00",Midwestern
122,Western Washington University,State,"$42,700.00","$75,400.00",Western

##### Merging By Index

In [ ]:
ivies3 = ivies.set_index('School Name')
regiones2 = regiones.set_index('School Name')

In [ ]:
pd.merge(ivies3, regiones2,left_index=True, right_index=True)

,School Type,Starting Median Salary,Mid-Career Median Salary,Region
School Name,,,,
Brown University,Ivy League,"$56,200.00","$109,000.00",Northeastern
Columbia University,Ivy League,"$59,400.00","$107,000.00",Northeastern
Cornell University,Ivy League,"$60,300.00","$110,000.00",Northeastern
Dartmouth College,Ivy League,"$58,000.00","$134,000.00",Northeastern
Harvard University,Ivy League,"$63,400.00","$124,000.00",Northeastern
Princeton University,Ivy League,"$66,500.00","$131,000.00",Northeastern
University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00",Northeastern
Yale University,Ivy League,"$59,100.00","$126,000.00",Northeastern

In [ ]:
pd.merge(ivies3, regiones2,left_index=True, right_on='School Name')

,School Type,Starting Median Salary,Mid-Career Median Salary,Region
School Name,,,,
Dartmouth College,Ivy League,"$58,000.00","$134,000.00",Northeastern
Princeton University,Ivy League,"$66,500.00","$131,000.00",Northeastern
Yale University,Ivy League,"$59,100.00","$126,000.00",Northeastern
Harvard University,Ivy League,"$63,400.00","$124,000.00",Northeastern
University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00",Northeastern
Cornell University,Ivy League,"$60,300.00","$110,000.00",Northeastern
Brown University,Ivy League,"$56,200.00","$109,000.00",Northeastern
Columbia University,Ivy League,"$59,400.00","$107,000.00",Northeastern

##### The join() Method

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html

##### Skill Challenge

1. Merge liberal arts schools with regions and assign the resulting dataframe to dfm. What region has the highest number of liberal arts schools?
2. Set school_name as the index of the mid_career dataframe, Do the operation inplace.
3. Merge the dfm and mid_career dataframes. Is the join operation one-to-one